// ===================================================================================================================================================
//  Вспомогательная сущность, которая позволяет лучше структурировать код, если присутствуют к примеру, какие - либо однотипные элементы
// ===================================================================================================================================================


// ====================================================================
// 2 типа записи enum
// ====================================================================

enum MemberShip {
    Simole,  //0
    Standart,//1
    Premium  //2
}

const memberShip = MemberShip.Standart
const memberShipReverse = MemberShip[2]
console.log(memberShip)
console.log(memberShipReverse)

enum SocialMedia {
    VK = 'vk',
    INSTAGRAM = 'insta'
}

const social = SocialMedia.INSTAGRAM